{
  "meta": {
    "bot_name": "@University_WissBot",
    "last_updated": "2025-12-19"
  },
  "footer": {
    "link_text": {
      "en": "Click here to view the bot",
      "ar": "انقر هنا لعرض البوت"
    },
    "link_url": "https://t.me/University_WissBot"
  },
  "pages": {
    "privacy": {
      "title": { "en": "Privacy Policy", "ar": "سياسة الخصوصية" },
      "summary": {
        "en": "This Privacy Policy describes how we collect, use, and handle your personal information when you use our chatbot, @University_WissBot.\n\nLast Updated: 19 December 2025",
        "ar": "توضح سياسة الخصوصية هذه كيفية جمعنا لمعلوماتك الشخصية واستخدامها والتعامل معها عند استخدامك لروبوتنا، @University_WissBot.\n\nآخر تحديث: ١٩ ديسمبر ٢٠٢٥"
      },
      "sections": [
        {
          "id": "info-we-collect",
          "heading": { "en": "1. Information We Collect", "ar": "١. المعلومات التي نجمعها" },
          "body": {
            "en": [
              "To provide and improve the University_WissBot service, we collect the following information:",
              "• Information Provided by Telegram: When you interact with the bot, we receive basic profile information from your Telegram account, which may include your Telegram User ID, first name, last name, and username.",
              "• Conversation Data: We store the full text of your conversations with the bot. This data is used solely to operate the chatbot's core functions, analyze general usage trends to understand user needs, and improve the accuracy and performance of its AI responses.",
              "• Interaction Metadata: We collect data about interactions (such as which of buttons is pressed) and associate this information with your username for a limited period necessary for troubleshooting and analysis. This allows us to monitor the bot's performance, troubleshoot specific user issues, identify interface errors, and guide future development.",
              "• Data We Do Not Collect: As of the last update of this policy, the bot is designed not to process, store, or collect any images, voice messages, videos, or other media files sent by users."
            ],
            "ar": [
              "لتقديم خدمة University_WissBot وتحسينها، نقوم بجمع المعلومات التالية:",
              "• المعلومات المقدمة من Telegram: عندما تتفاعل مع البوت، نتلقى معلومات الملف الشخصي الأساسية من حساب Telegram الخاص بك، والتي قد تتضمن معرف مستخدم Telegram الخاص بك، والاسم الأول، والاسم الأخير، واسم المستخدم.",
              "• بيانات المحادثة: نقوم بتخزين النص الكامل لمحادثاتك مع الروبوت. تُستخدم هذه البيانات حصراً لتشغيل الوظائف الأساسية للروبوت، وتحليل اتجاهات الاستخدام العامة لفهم احتياجات المستخدمين، وتحسين دقة وأداء استجابات الذكاء الاصطناعي.",
              "• بيانات التفاعل الوصفية: نقوم بجمع بيانات حول التفاعلات (مثل الزر الذي تم الضغط عليه) ونربط هذه المعلومات باسم المستخدم الخاص بك لفترة محدودة ضرورية لاستكشاف الأخطاء وإصلاحها وتحليلها. يتيح لنا ذلك مراقبة أداء الروبوت، واستكشاف أخطاء المستخدمين وإصلاحها، وتحديد أخطاء واجهة المستخدم، وتوجيه التطوير المستقبلي.",
              "• البيانات التي لا نجمعها: اعتبارًا من آخر تحديث لهذه السياسة، تم تصميم الروبوت بحيث لا يقوم بمعالجة أو تخزين أو جمع أي صور أو رسائل صوتية أو مقاطع فيديو أو ملفات وسائط أخرى يرسلها المستخدمون."
            ]
          }
        },
        {
          "id": "how-we-use-info",
          "heading": { "en": "2. How We Use Information", "ar": "٢. كيف نستخدم المعلومات" },
          "body": {
            "en": [
              "We use the information we collect for the following purposes:",
              "• To Provide and Maintain Core Services: To operate the University_WissBot, respond to your commands and AI queries, and deliver core functionalities like providing book references, schedules, and lecture information.",
              "• For Service Improvement and Development: This is a primary use of conversation data. We analyze interactions to:\n    ○ 'Identify new features and needs' (e.g., recognizing when users request unsupported lectures, prompting us to add them).\n    ○ 'Improve the AI's logic and response accuracy' by refining its way of thinking to better meet user expectations.\n    ○ 'Enhance usability' (e.g., making the bot respond to \"start\" in addition to \"/start\").\n    ○ Conduct 'aggregate trend analysis' (e.g., determining the percentage of users asking about schedules) to guide our development roadmap.",
              "• For Troubleshooting and Security: To manually review specific interactions for debugging, monitor performance, identify interface errors, prevent abuse, and ensure the security and reliability of our service.",
              "• For Future Personalization: While the current bot does 'not' create detailed individual user profiles, we may use your interaction history in the future to tailor features and information to be more relevant to you (e.g., prioritizing your faculty's schedule)."
            ],
            "ar": [
              "نستخدم المعلومات التي نجمعها للأغراض التالية:",
              "• توفير الخدمات الأساسية وصيانتها: لتشغيل روبوت الجامعة (University_WissBot)، والاستجابة لأوامركم واستفسارات الذكاء الاصطناعي، وتقديم الوظائف الأساسية مثل توفير مراجع الكتب والبرامج الدراسية ومعلومات المحاضرات.",
              "• تحسين الخدمة وتطويرها: يُعد هذا الاستخدام الأساسي لبيانات المحادثة. نحلل التفاعلات من أجل:\n    ○ 'تحديد الميزات والاحتياجات الجديدة' (على سبيل المثال، التعرف على طلبات المستخدمين للمحاضرات غير المدعومة، مما يدفعنا إلى إضافتها).\n    ○ 'تحسين منطق الذكاء الاصطناعي ودقة استجابته' من خلال تحسين طريقة تفكيره لتلبية توقعات المستخدمين بشكل أفضل.\n    ○ 'تعزيز سهولة الاستخدام' (على سبيل المثال، جعل الروبوت يستجيب لكلمة \"start\" بالإضافة إلى \"/start\").\n    ○ إجراء 'تحليل إجمالي للاتجاهات' (على سبيل المثال، تحديد نسبة المستخدمين الذين يسألون عن الجداول الزمنية) لتوجيه خارطة طريقنا التطويرية.",
              "• لأغراض استكشاف الأخطاء وإصلاحها والأمان: لمراجعة تفاعلات محددة يدويًا لتصحيح الأخطاء، ومراقبة الأداء، وتحديد أخطاء واجهة المستخدم، ومنع إساءة الاستخدام، وضمان أمان وموثوقية خدمتنا.",
              "• للتخصيص المستقبلي: على الرغم من أن الروبوت الحالي 'لا' يقوم بإنشاء ملفات تعريف فردية مفصلة للمستخدمين، إلا أننا قد نستخدم سجل تفاعلك في المستقبل لتخصيص الميزات والمعلومات لتكون أكثر صلة بك (على سبيل المثال، إعطاء الأولوية لبرنامج كليتك)."
            ]
          }
        },
        {
          "id": "data-sharing",
          "heading": { "en": "3. Data Sharing & Third Parties", "ar": "٣. مشاركة البيانات والأطراف الثالثة" },
          "body": {
            "en": [
              "We share your data with trusted third-party service providers only to the extent necessary to operate the bot:",
              "• Cloud Hosting Provider: The bot is hosted on a dedicated cloud platform. All data processed by the bot passes through this provider's infrastructure.",
              "• AI Service Providers: The text-based AI functionality is powered by third-party artificial intelligence models such as OpenAI's API. Your conversation data is shared with these providers to generate responses. The specific AI model provider may change depending on system performance and usage demands to ensure reliability.",
              "• Other Disclosures: We may also share data if necessary to comply with a legal obligation, protect our rights, or prevent misuse."
            ],
              "ar": [
                "نشارك بياناتك مع مزودي خدمات موثوقين من جهات خارجية فقط بالقدر اللازم لتشغيل الروبوت:",
                "• مزود خدمة الاستضافة السحابية: يُستضاف الروبوت على منصة سحابية مخصصة. تمر جميع البيانات التي يعالجها الروبوت عبر بنية هذا المزود التحتية.",
                "• مزودو خدمات الذكاء الاصطناعي: تعتمد وظائف الذكاء الاصطناعي النصية على نماذج ذكاء اصطناعي تابعة لجهات خارجية، مثل واجهة برمجة تطبيقات OpenAI. تُشارك بيانات محادثتك مع هؤلاء المزودين لإنشاء الردود. قد يتغير مزود نموذج الذكاء الاصطناعي المحدد بناءً على أداء النظام ومتطلبات الاستخدام لضمان الموثوقية.",
                "• إفصاحات أخرى: قد نشارك البيانات أيضًا إذا لزم الأمر للامتثال لالتزام قانوني، أو لحماية حقوقنا، أو لمنع إساءة الاستخدام."
              ]
          }
        },
        {
          "id": "data-retention",
          "heading": { "en": "4. Data Retention", "ar": "٤. الاحتفاظ بالبيانات" },
          "body": {
            "en": [
              "We retain your personal data only for as long as is necessary to fulfill the purposes described in this policy, unless a longer retention period is required for operational needs, such as maintaining the broadcast system, or permitted by law.",
              "• Telegram Profile Data (User ID, name) is retained indefinitely to provide you with continuous service and for operational functions like broadcasting important updates.",
              "• Conversation Data and Interaction Metadata are retained for analysis and service improvement. We periodically review and delete this data once it has served its purpose for identifying trends, fixing errors, and improving the AI's performance.",
              "• We commit to deleting your personal data in a secure manner when it is no longer needed for the stated purposes."
            ],
            "ar": [
              "نحتفظ ببياناتك الشخصية فقط للفترة الضرورية لتحقيق الأغراض الموضحة في هذه السياسة، ما لم تتطلب الاحتياجات التشغيلية فترة احتفاظ أطول، مثل صيانة نظام الاذاعة، أو ما يسمح بها القانون.",
              "• يتم الاحتفاظ ببيانات ملف تعريف تيليجرام (معرف المستخدم، الاسم) إلى أجل غير مسمى لتزويدك بخدمة مستمرة وللوظائف التشغيلية مثل اذاعة التحديثات المهمة.",
              "• يتم الاحتفاظ ببيانات المحادثة وبيانات تعريف التفاعل لأغراض التحليل وتحسين الخدمة. نقوم بمراجعة هذه البيانات دوريًا وحذفها بمجرد انتهاء الغرض منها لتحديد الاتجاهات وتصحيح الأخطاء وتحسين أداء الذكاء الاصطناعي.",
              "• نلتزم بحذف بياناتك الشخصية بطريقة آمنة عندما لا تعود هناك حاجة إليها للأغراض المذكورة."
            ]
          }
        },
        {
          "id": "user-rights",
          "heading": { "en": "5. Your Rights & Choices", "ar": "٥. حقوقك وخياراتك" },
          "body": {
            "en": [
              "You have the following choices regarding your data:",
              "• Access to Your Conversations: For your privacy and security, we do not provide direct access to the internal logs of your data stored on our servers. You can review your conversation history within your direct message (DM) history with the bot on Telegram.",
              "• Profile Data Correction: The Telegram profile data we store (like your first name or username) is automatically updated when you change it in your Telegram account. We do not perform manual edits to this data.",
              "• Request Data Deletion: You may contact us to request the deletion of your personal data. We will evaluate such requests and comply where reasonably feasible and not in conflict with our legitimate operational needs, legal obligations, or the necessity to maintain the integrity of our systems.",
              "• Account Closure: There is no separate \"account closure\" process. Data retention and deletion practices are governed by this policy as a whole. Data from a previously used account may persist as described in the Data Retention section.",
              "• Contact for Requests: To make a deletion request or for any other privacy-related questions, please contact us using the information provided in the \"Contact Us\" section."
            ],
            "ar": [
              "لديك الخيارات التالية فيما يتعلق ببياناتك:",
              "• الوصول إلى محادثاتك: حرصًا على خصوصيتك وأمانك، لا نوفر وصولًا مباشرًا إلى سجلات بياناتك الداخلية المخزنة على خوادمنا. يمكنك مراجعة سجل محادثاتك ضمن سجل الرسائل المباشرة مع البوت على تيليجرام.",
              "• تصحيح بيانات الملف الشخصي: يتم تحديث بيانات ملفك الشخصي على تيليجرام المخزنة لدينا (مثل اسمك الأول أو اسم المستخدم) تلقائيًا عند تغييرها في حسابك على تيليجرام. لا نقوم بإجراء أي تعديلات يدوية على هذه البيانات.",
              "• طلب حذف البيانات: يمكنك التواصل معنا لطلب حذف بياناتك الشخصية. سنقوم بتقييم هذه الطلبات والامتثال لها حيثما كان ذلك ممكنًا بشكل معقول وبما لا يتعارض مع احتياجاتنا التشغيلية المشروعة أو التزاماتنا القانونية أو ضرورة الحفاظ على سلامة أنظمتنا.",
              "• إغلاق الحساب: لا توجد عملية 'إغلاق حساب' منفصلة. تخضع ممارسات الاحتفاظ بالبيانات وحذفها لهذه السياسة ككل. قد تبقى البيانات من حساب مستخدم سابقًا كما هو موضح في قسم الاحتفاظ بالبيانات.",
              "• التواصل للطلبات: لتقديم طلب حذف أو لأي استفسارات أخرى متعلقة بالخصوصية، يرجى التواصل معنا باستخدام المعلومات الواردة في قسم 'اتصل بنا'."
            ]
          }
        },
        {
          "id": "data-security",
          "heading": { "en": "6. Data Security", "ar": "٦. أمن البيانات" },
          "body": {
            "en": [
              "We implement a range of measures designed to protect your personal information from unauthorized access, loss, or misuse. Our security approach includes:",
              "• Administrative Security: Access to the bot's backend systems and data is strictly limited to the core development team and is protected by account authentication.",
              "• Infrastructure Security: We rely on our professional cloud hosting provider, which employs robust network security measures—including firewalls, anti-bot protections, and DDoS mitigation—to safeguard the servers where data is processed.",
              "• Security Development: We follow standard practices to secure the bot's code against common vulnerabilities.",
              "Please note that data is currently stored in structured files. We are actively developing the service and plan to migrate to a dedicated database system with enhanced security features in a future update.",
              "While we strive to use commercially acceptable means to protect your data, no method of electronic transmission or storage is 100% secure. We cannot guarantee absolute security."
            ],
            "ar": [
              "نُطبّق مجموعة من الإجراءات المصممة لحماية معلوماتك الشخصية من الوصول غير المصرح به أو الفقدان أو سوء الاستخدام. يشمل نهجنا الأمني ​​ما يلي:",
              "• أمن الإدارة: يقتصر الوصول إلى أنظمة وبيانات البوت الخلفية بشكل صارم على فريق التطوير الأساسي، ويتم حمايته من خلال مصادقة الحساب.",
              "• أمن البنية التحتية: نعتمد على مزود استضافة سحابية محترف، يستخدم إجراءات أمنية قوية للشبكة - بما في ذلك جدران الحماية، وحماية من البوتات، وتخفيف هجمات DDoS - لحماية الخوادم التي تُعالج عليها البيانات.",
              "• تطوير الأمان: نتبع الممارسات القياسية لتأمين كود البوت ضد الثغرات الأمنية الشائعة.",
              "يرجى ملاحظة أن البيانات تُخزّن حاليًا في ملفات مُهيكلة. نعمل بنشاط على تطوير الخدمة ونخطط للانتقال إلى نظام قاعدة بيانات مُخصص بميزات أمان مُحسّنة في تحديث مستقبلي.",
              "مع أننا نسعى جاهدين لاستخدام الوسائل المقبولة تجاريًا لحماية بياناتك، إلا أنه لا توجد طريقة نقل أو تخزين إلكترونية آمنة بنسبة 100%. لا يمكننا ضمان أمان مطلق."
            ]
          }
        },
        {
          "id": "policy-changes",
          "heading": { "en": "7. Changes to This Policy", "ar": "٧. تغييرات على هذه السياسة" },
          "body": {
            "en": [
              "We may update this Privacy Policy from time to time. When we do, we will revise the \"Last Updated\" date at the top of this page.",
              "We encourage you to periodically review this page for the latest information on our privacy practices. Your continued use of University_WissBot after any changes to this policy constitutes your acceptance of the updated terms."
            ],
            "ar": [
              "قد نقوم بتحديث سياسة الخصوصية هذه من وقت لآخر. وعندها، سنقوم بتحديث تاريخ 'آخر تحديث' أعلى هذه الصفحة.",
              "نشجعك على مراجعة هذه الصفحة دوريًا للاطلاع على أحدث المعلومات حول ممارسات الخصوصية لدينا. استمرارك في استخدام University_WissBot بعد أي تغييرات في هذه السياسة يُعدّ قبولًا منك للشروط المُحدَّثة."
            ]
          }
        },
        {
          "id": "contact",
          "heading": { "en": "8. Contact Us", "ar": "٨. اتصل بنا" },
          "body": {
            "en": [
              "For any questions about this Privacy Policy, to make a request regarding your data, or for any other privacy-related concerns, please use the \"Contacts\" button within the University_WissBot interface on Telegram.",
              "This is the preferred and most efficient method to reach the responsible team."
            ],
            "ar": [
              "لأي استفسارات حول سياسة الخصوصية هذه، أو لتقديم طلب يتعلق ببياناتك، أو لأي مخاوف أخرى متعلقة بالخصوصية، يُرجى استخدام زر 'التواصل' ضمن واجهة University_WissBot على تطبيق تيليجرام.",
              "هذه هي الطريقة المُفضلة والأكثر فعالية للتواصل مع الفريق المسؤول."
            ]
          }
        }
      ]
    },
    "terms": {
      "title": { "en": "Terms of Service", "ar": "شروط الخدمة" },
      "summary": {
        "en": "Placeholder terms summary.",
        "ar": "ملخص مؤقت لشروط الخدمة."
      },
      "sections": [
        { "id": "usage", "heading": { "en": "1. Use of the Service", "ar": "١. استخدام الخدمة" }, "body": { "en": ["Placeholder."], "ar": ["نص مؤقت."] } },
        { "id": "limitations", "heading": { "en": "2. Limitations", "ar": "٢. القيود" }, "body": { "en": ["Placeholder."], "ar": ["نص مؤقت."] } },
        { "id": "liability", "heading": { "en": "3. Liability", "ar": "٣. المسؤولية" }, "body": { "en": ["Placeholder."], "ar": ["نص مؤقت."] } }
      ]
    }
  }
}
